out/thread_100/fresh/foundationdb/sqlite/no_cache/c/out_run.txt
normal
normal
normal
[...]
start running at 2024.02.21.10:48:49
start running at 2024.02.21.10:48:49
start running at 2024.02.21.10:48:49
[...]
amd64
start running at 2024.02.21.10:48:49
start running at 2024.02.21.10:48:49
start running at 2024.02.21.10:48:49
/lib/linux/amd64/libfdb_c.so
amd64
/lib/linux/amd64/libfdb_java.so
Open normal subspace
Open normal subspace
Open normal subspace
[...]
Finish running at 2024.02.21.10:51:18
Finish running at 2024.02.21.10:51:18
Finish running at 2024.02.21.10:51:18
[...]
[OVERALL], RunTime(ms), 148762
[OVERALL], Throughput(ops/sec), 13444.293569594385
[TOTAL_GCS_PS_Scavenge], Count, 32
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 2334
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 1.5689490595716646
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 32
[TOTAL_GC_TIME], Time(ms), 2334
[TOTAL_GC_TIME_%], Time(%), 1.5689490595716646
[READ], Operations, 2000000
[READ], AverageLatency(us), 7398.734411
[READ], MinLatency(us), 1277
[READ], MaxLatency(us), 192255
[READ], 95thPercentileLatency(us), 9591
[READ], 99thPercentileLatency(us), 17695
[READ], Return=OK, 2000000
[CLEANUP], Operations, 100
[CLEANUP], AverageLatency(us), 90697.35
[CLEANUP], MinLatency(us), 1006
[CLEANUP], MaxLatency(us), 196735
[CLEANUP], 95thPercentileLatency(us), 166911
[CLEANUP], 99thPercentileLatency(us), 183679